#ifndef HIDL_GENERATED_ANDROID_HARDWARE_GRAPHICS_BUFFERQUEUE_V2_0_IGRAPHICBUFFERPRODUCER_H
#define HIDL_GENERATED_ANDROID_HARDWARE_GRAPHICS_BUFFERQUEUE_V2_0_IGRAPHICBUFFERPRODUCER_H

#include <android/hardware/graphics/bufferqueue/2.0/IProducerListener.h>
#include <android/hardware/graphics/bufferqueue/2.0/types.h>
#include <android/hardware/graphics/common/1.2/types.h>
#include <android/hidl/base/1.0/IBase.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace graphics {
namespace bufferqueue {
namespace V2_0 {

/**
 * Ref: frameworks/native/include/gui/IGraphicBufferProducer.h:
 *      IGraphicBufferProducer
 * This is a wrapper/wrapped HAL interface for the actual binder interface.
 */
struct IGraphicBufferProducer : public ::android::hidl::base::V1_0::IBase {
    /**
     * Type tag for use in template logic that indicates this is a 'pure' class.
     */
    typedef android::hardware::details::i_tag _hidl_tag;

    /**
     * Fully qualified interface name: "android.hardware.graphics.bufferqueue@2.0::IGraphicBufferProducer"
     */
    static const char* descriptor;

    // Forward declaration for forward reference support:
    struct DequeueBufferInput;
    struct DequeueBufferOutput;
    struct QueueBufferInput;
    struct QueueBufferOutput;

    /**
     * Input data for dequeueBuffer() specifying desired attributes of a buffer
     * to dequeue.
     * 
     * This structure contains 4 fields from
     * +llndk libnativewindow#AHardwareBuffer_Desc.
     * 
     * The `width` and `height` parameters must be no greater than the minimum
     * of `GL_MAX_VIEWPORT_DIMS` and `GL_MAX_TEXTURE_SIZE` (see:
     * glGetIntegerv()). An error due to invalid dimensions may not be reported
     * until updateTexImage() is called.
     * 
     * If `width` and `height` are both zero, the default dimensions shall be
     * used. If only one of `width` and `height` is zero, dequeueBuffer() shall
     * return `BAD_VALUE` in `status`.
     * 
     * If `format` is zero, the default format shall be used.
     * 
     * `usage` shall be merged with the usage flags set from the consumer side.
     * 
     * @sa +llndk libnativewindow#AHardwareBuffer_Desc.
     */
    struct DequeueBufferInput final {
        uint32_t width __attribute__ ((aligned(4)));
        uint32_t height __attribute__ ((aligned(4)));
        uint32_t format __attribute__ ((aligned(4)));
        uint64_t usage __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::DequeueBufferInput, width) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::DequeueBufferInput, height) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::DequeueBufferInput, format) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::DequeueBufferInput, usage) == 16, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::DequeueBufferInput) == 24, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::DequeueBufferInput) == 8, "wrong alignment");

    /**
     * Output data for dequeueBuffer().
     * 
     * A `DequeueBufferOutput` object returned from dequeueBuffer() shall be
     * valid if and only if `status` returned from the same call is `OK`.
     */
    struct DequeueBufferOutput final {
        uint64_t bufferAge __attribute__ ((aligned(8)));
        bool bufferNeedsReallocation __attribute__ ((aligned(1)));
        bool releaseAllBuffers __attribute__ ((aligned(1)));
        ::android::hardware::hidl_handle fence __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::DequeueBufferOutput, bufferAge) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::DequeueBufferOutput, bufferNeedsReallocation) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::DequeueBufferOutput, releaseAllBuffers) == 9, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::DequeueBufferOutput, fence) == 16, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::DequeueBufferOutput) == 32, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::DequeueBufferOutput) == 8, "wrong alignment");

    struct QueueBufferInput final {
        int64_t timestamp __attribute__ ((aligned(8)));
        bool isAutoTimestamp __attribute__ ((aligned(1)));
        int32_t dataSpace __attribute__ ((aligned(4)));
        ::android::hardware::hidl_array<int32_t, 4> crop __attribute__ ((aligned(4)));
        int32_t transform __attribute__ ((aligned(4)));
        int32_t stickyTransform __attribute__ ((aligned(4)));
        ::android::hardware::hidl_handle fence __attribute__ ((aligned(8)));
        ::android::hardware::hidl_vec<::android::hardware::hidl_array<int32_t, 4>> surfaceDamage __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferInput, timestamp) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferInput, isAutoTimestamp) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferInput, dataSpace) == 12, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferInput, crop) == 16, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferInput, transform) == 32, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferInput, stickyTransform) == 36, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferInput, fence) == 40, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferInput, surfaceDamage) == 56, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferInput) == 72, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferInput) == 8, "wrong alignment");

    /**
     * Information about the queued buffer. `QueueBufferOutput` is used in both
     * queueBuffer() and connect().
     */
    struct QueueBufferOutput final {
        uint32_t width __attribute__ ((aligned(4)));
        uint32_t height __attribute__ ((aligned(4)));
        int32_t transformHint __attribute__ ((aligned(4)));
        uint32_t numPendingBuffers __attribute__ ((aligned(4)));
        uint64_t nextFrameNumber __attribute__ ((aligned(8)));
        bool bufferReplaced __attribute__ ((aligned(1)));
    };

    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferOutput, width) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferOutput, height) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferOutput, transformHint) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferOutput, numPendingBuffers) == 12, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferOutput, nextFrameNumber) == 16, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferOutput, bufferReplaced) == 24, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferOutput) == 32, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::bufferqueue::V2_0::IGraphicBufferProducer::QueueBufferOutput) == 8, "wrong alignment");

    /**
     * Returns whether this object's implementation is outside of the current process.
     */
    virtual bool isRemote() const override { return false; }

    /**
     * Sets the maximum number of buffers that can be dequeued at one time. If
     * this method succeeds, any new buffer slots shall be both unallocated and
     * owned by the buffer queue, i.e., they are not owned by the producer or
     * the consumer. Calling this may cause some buffer slots to be emptied. If
     * the caller is caching the contents of the buffer slots, it must empty
     * that cache after calling this method.
     * 
     * @p maxDequeuedBuffers must not be less than the number of currently
     * dequeued buffer slots; otherwise, the returned @p status shall be
     * `BAD_VALUE`.
     * 
